junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_wifi.c
/* SPDX-License-Identifier: Apache-2.0 */
#include "bk7259_ops.h"
#include "bk7259_wifi_internal.h"

#include <common/bk_err.h>
#include <components/event.h>
#include <components/log.h>
#include <components/netif_types.h>
#include <easyflash.h>
#include <modules/wifi.h>
#include <modules/wifi_types.h>
#include <os/os.h>

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#define TAG "mybot_wifi"
#define WIFI_CREDENTIAL_KEY "mybot.wifi.v1"
#define WIFI_CREDENTIAL_MAGIC 0x4d425746u
#define WIFI_CREDENTIAL_VERSION 1u
#define WIFI_CONNECT_TIMEOUT_MS 30000u
#define WIFI_RESTART_DELAY_MS 100u
#define WIFI_WAIT_SLICE_MS 250u

typedef struct {
    uint32_t magic;
    uint16_t version;
    uint16_t record_size;
    uint8_t ssid_length;
    uint8_t password_length;
    uint8_t reserved[2];
    char ssid[WIFI_SSID_STR_LEN];
    char password[WIFI_PASSWORD_LEN];
    uint8_t reserved_tail[2];
} wifi_credential_record_t;

_Static_assert(sizeof(wifi_credential_record_t) == 112,
               "unexpected Wi-Fi credential record size");

typedef struct {
    beken_mutex_t lock;
    beken_mutex_t operation_lock;
    beken_semaphore_t event;
    mybot_wifi_event_handler_t emit;
    void *emit_user_data;
    mybot_wifi_event_t last_sdk_event;
    uint32_t sta_generation;
    char target_ssid[WIFI_SSID_STR_LEN];
    bool prepared;
    bool shutting_down;
    bool netif_callback_registered;
    bool disconnect_callback_registered;
    bool scan_callback_registered;
    bool sdk_attached;
    bool last_sdk_event_valid;
    bool sta_started;
    bool sta_has_ip;
    bool scan_in_progress;
    bool scan_done;
} wifi_manager_t;

static wifi_manager_t s_wifi;

static const char *wifi_event_name(mybot_wifi_event_t event) {
    switch (event) {
    case MYBOT_WIFI_EVENT_STA_CONNECTED:
        return "connected";
    case MYBOT_WIFI_EVENT_STA_DISCONNECTED:
        return "disconnected";
    case MYBOT_WIFI_EVENT_FAILED:
        return "failed";
    default:
        return "unknown";
    }
}

static int run_provisioning_portal(const char *device_id) {
    (void)bk7259_lcd_show_screen(MYBOT_LCD_SCREEN_WIFI_PROVISIONING);
    if (bk7259_prompt_play_provisioning() < 0) {
        BK_LOGW(TAG, "provisioning prompt unavailable; continuing without audio\r\n");
    }
    int result = bk7259_wifi_portal_run(device_id);
    if (result == 0 && bk7259_prompt_play_success() < 0) {
        BK_LOGW(TAG, "provisioning success prompt unavailable\r\n");
    }
    (void)bk7259_lcd_show_screen(result == 0 ? MYBOT_LCD_SCREEN_STARTING_SERVICES
                                             : MYBOT_LCD_SCREEN_FAILED);
    return result;
}

static void secure_zero(void *data, size_t size) {
    volatile uint8_t *bytes = data;
    while (size-- > 0) {
        *bytes++ = 0;
    }
}

static size_t bounded_string_length(const char *value, size_t capacity) {
    if (!value) {
        return capacity;
    }
    const char *terminator = memchr(value, '\0', capacity);
    return terminator ? (size_t)(terminator - value) : capacity;
}

static bool credentials_are_valid(const wifi_credential_record_t *record) {
    if (!record || record->magic != WIFI_CREDENTIAL_MAGIC ||
        record->version != WIFI_CREDENTIAL_VERSION ||
        record->record_size != sizeof(*record) || record->ssid_length == 0 ||
        record->ssid_length >= sizeof(record->ssid) ||
        record->password_length >= sizeof(record->password) ||
        record->ssid[record->ssid_length] != '\0' ||
        record->password[record->password_length] != '\0' ||
        memchr(record->ssid, '\0', record->ssid_length) ||
        memchr(record->password, '\0', record->password_length)) {
        return false;
    }

    static const uint8_t zeros[2];
    return memcmp(record->reserved, zeros, sizeof(record->reserved)) == 0 &&
           memcmp(record->reserved_tail, zeros, sizeof(record->reserved_tail)) == 0;
}

/* Returns 1 for an absent record, 0 for a valid record, and -1 for corruption. */
static int load_credentials(wifi_credential_record_t *record) {
    if (!record) {
        return -1;
    }

    memset(record, 0, sizeof(*record));
    size_t saved_length = 0;
    (void)ef_get_env_blob(WIFI_CREDENTIAL_KEY, NULL, 0, &saved_length);
    if (saved_length == 0) {
        return 1;
    }
    if (saved_length != sizeof(*record) ||
        ef_get_env_blob(WIFI_CREDENTIAL_KEY, record, sizeof(*record), NULL) !=
            sizeof(*record) ||
        !credentials_are_valid(record)) {
        secure_zero(record, sizeof(*record));
        return -1;
    }
    return 0;
}

static bool manager_ready_locked(const wifi_manager_t *manager) {
    return manager->prepared && !manager->shutting_down;
}

/* Keeping emit() under the manager lock serializes SDK events and makes the
 * SDK destroy callback a completion barrier without owning the product STA. */
static void emit_sdk_transition_locked(wifi_manager_t *manager,
                                       mybot_wifi_event_t event) {
    if (!manager->sdk_attached || !manager->emit ||
        (manager->last_sdk_event_valid && manager->last_sdk_event == event)) {
        return;
    }

    manager->last_sdk_event = event;
    manager->last_sdk_event_valid = true;
    BK_LOGI(TAG, "SDK connectivity event: %s\r\n", wifi_event_name(event));
    manager->emit(event, manager->emit_user_data);
}

static void set_sta_connected_locked(wifi_manager_t *manager) {
    if (!manager->sta_has_ip) {
        manager->sta_has_ip = true;
        BK_LOGI(TAG, "STA connectivity -> connected (IPv4 ready)\r\n");
        emit_sdk_transition_locked(manager, MYBOT_WIFI_EVENT_STA_CONNECTED);
    }
}

static void set_sta_disconnected_locked(wifi_manager_t *manager) {
    bool was_connected = manager->sta_has_ip;
    manager->sta_has_ip = false;
    if (was_connected) {
        BK_LOGI(TAG, "STA connectivity -> disconnected\r\n");
        emit_sdk_transition_locked(manager, MYBOT_WIFI_EVENT_STA_DISCONNECTED);
    }
}

static void signal_waiter(wifi_manager_t *manager) {
    if (manager->event) {
        (void)rtos_set_semaphore(&manager->event);
    }
}

