junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_wifi.c
static bool string_is_terminated(const char *value, size_t capacity) {
    return value && memchr(value, '\0', capacity) != NULL;
}

static bool sta_link_matches(const char *ssid) {
    wifi_link_status_t status = {0};
    bool matches = ssid && bk_wifi_sta_get_link_status(&status) == BK_OK &&
                   status.state == WIFI_LINKSTATE_STA_GOT_IP &&
                   string_is_terminated(status.ssid, sizeof(status.ssid)) &&
                   strcmp(status.ssid, ssid) == 0;
    secure_zero(&status, sizeof(status));
    return matches;
}

static bk_err_t wifi_event_callback(void *arg, event_module_t module, int event_id,
                                    void *event_data) {
    wifi_manager_t *manager = arg;
    if (!manager || !manager->lock) {
        return BK_OK;
    }

    if (module == EVENT_MOD_NETIF && event_id == EVENT_NETIF_GOT_IP4) {
        const netif_event_got_ip4_t *got_ip = event_data;
        if (!got_ip || got_ip->netif_if != NETIF_IF_STA) {
            return BK_OK;
        }

        char target_ssid[WIFI_SSID_STR_LEN] = {0};
        uint32_t generation = 0;
        if (rtos_lock_mutex(&manager->lock) != BK_OK) {
            return BK_OK;
        }
        if (manager_ready_locked(manager) && manager->target_ssid[0]) {
            memcpy(target_ssid, manager->target_ssid, sizeof(target_ssid));
            generation = manager->sta_generation;
        }
        (void)rtos_unlock_mutex(&manager->lock);

        bool matches = generation != 0 && sta_link_matches(target_ssid);
        if (rtos_lock_mutex(&manager->lock) == BK_OK) {
            if (matches && manager_ready_locked(manager) &&
                manager->sta_generation == generation &&
                strcmp(manager->target_ssid, target_ssid) == 0) {
                set_sta_connected_locked(manager);
            }
            (void)rtos_unlock_mutex(&manager->lock);
        }
        signal_waiter(manager);
        return BK_OK;
    }

    if (module != EVENT_MOD_WIFI) {
        return BK_OK;
    }
    if (rtos_lock_mutex(&manager->lock) != BK_OK) {
        return BK_OK;
    }
    if (manager_ready_locked(manager)) {
        if (event_id == EVENT_WIFI_STA_DISCONNECTED) {
            set_sta_disconnected_locked(manager);
        } else if (event_id == EVENT_WIFI_SCAN_DONE) {
            manager->scan_done = true;
            manager->scan_in_progress = false;
        }
    }
    (void)rtos_unlock_mutex(&manager->lock);
    signal_waiter(manager);
    return BK_OK;
}

static void drain_event(wifi_manager_t *manager) {
    while (manager->event &&
           rtos_get_semaphore(&manager->event, BEKEN_NO_WAIT) == BK_OK) {
    }
}

static uint32_t remaining_time_ms(uint32_t start_ms, uint32_t timeout_ms) {
    uint32_t elapsed_ms = rtos_get_time() - start_ms;
    return elapsed_ms < timeout_ms ? timeout_ms - elapsed_ms : 0;
}

static bool manager_accept_connected(wifi_manager_t *manager, const char *ssid,
                                     uint32_t generation) {
    if (!sta_link_matches(ssid) || rtos_lock_mutex(&manager->lock) != BK_OK) {
        return false;
    }

    bool accepted = manager_ready_locked(manager) &&
                    manager->sta_generation == generation &&
                    strcmp(manager->target_ssid, ssid) == 0;
    if (accepted) {
        set_sta_connected_locked(manager);
    }
    (void)rtos_unlock_mutex(&manager->lock);
    return accepted;
}

static int wait_for_ipv4(wifi_manager_t *manager, const char *ssid,
                         uint32_t generation, uint32_t timeout_ms) {
    uint32_t start_ms = rtos_get_time();
    for (;;) {
        if (manager_accept_connected(manager, ssid, generation)) {
            return 0;
        }

        if (rtos_lock_mutex(&manager->lock) != BK_OK) {
            return -1;
        }
        bool valid = manager_ready_locked(manager) &&
                     manager->sta_generation == generation &&
                     strcmp(manager->target_ssid, ssid) == 0;
        (void)rtos_unlock_mutex(&manager->lock);
        uint32_t remaining_ms = remaining_time_ms(start_ms, timeout_ms);
        if (!valid) {
            BK_LOGW(TAG, "STA IPv4 wait aborted by a network state change\r\n");
            return -1;
        }
        if (remaining_ms == 0) {
            BK_LOGW(TAG, "STA IPv4 acquisition timed out\r\n");
            return -1;
        }
        (void)rtos_get_semaphore(&manager->event,
                                 remaining_ms < WIFI_WAIT_SLICE_MS
                                     ? remaining_ms
                                     : WIFI_WAIT_SLICE_MS);
    }
}

/* operation_lock is held by the caller. */
static int stop_sta(wifi_manager_t *manager) {
    if (rtos_lock_mutex(&manager->lock) != BK_OK) {
        return -1;
    }
    bool was_started = manager->sta_started;
    manager->sta_started = false;
    ++manager->sta_generation;
    manager->target_ssid[0] = '\0';
    set_sta_disconnected_locked(manager);
    (void)rtos_unlock_mutex(&manager->lock);

    if (was_started) {
        BK_LOGI(TAG, "stopping STA\r\n");
        if (bk_wifi_sta_stop() != BK_OK) {
            BK_LOGE(TAG, "failed to stop STA\r\n");
            return -1;
        }
        BK_LOGI(TAG, "STA stopped\r\n");
    }
    return 0;
}

static int start_sta(wifi_manager_t *manager, const char *ssid,
                     const char *password, uint32_t *generation) {
    wifi_sta_config_t config = {0};
    size_t ssid_length = bounded_string_length(ssid, WIFI_SSID_STR_LEN);
    size_t password_length = bounded_string_length(password, WIFI_PASSWORD_LEN);
    if (ssid_length == 0 || ssid_length >= WIFI_SSID_STR_LEN ||
        password_length >= WIFI_PASSWORD_LEN) {
        return -1;
    }

    memcpy(config.ssid, ssid, ssid_length + 1);
    memcpy(config.password, password, password_length + 1);
    config.security = WIFI_SECURITY_AUTO;
    config.auto_reconnect_count = 0;
    config.auto_reconnect_timeout = 0;
    config.disable_auto_reconnect_after_disconnect = false;

    if (rtos_lock_mutex(&manager->lock) != BK_OK) {
        secure_zero(&config, sizeof(config));
        return -1;
    }
    if (!manager_ready_locked(manager)) {
        (void)rtos_unlock_mutex(&manager->lock);
        secure_zero(&config, sizeof(config));
        return -1;
    }
    ++manager->sta_generation;
    *generation = manager->sta_generation;
    memcpy(manager->target_ssid, ssid, ssid_length + 1);
    manager->sta_has_ip = false;
    (void)rtos_unlock_mutex(&manager->lock);

    BK_LOGI(TAG, "starting STA\r\n");
    bk_err_t result = bk_wifi_sta_set_config(&config);
    if (result == BK_OK) {
        result = bk_wifi_sta_start();
    }
    secure_zero(&config, sizeof(config));

