junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_wifi.c
    bool driver_started = result == BK_OK;
    if (rtos_lock_mutex(&manager->lock) != BK_OK) {
        if (driver_started) {
            (void)bk_wifi_sta_stop();
        }
        return -1;
    }
    if (driver_started && manager_ready_locked(manager) &&
        manager->sta_generation == *generation) {
        manager->sta_started = true;
    } else {
        ++manager->sta_generation;
        manager->sta_started = false;
        manager->target_ssid[0] = '\0';
        result = BK_FAIL;
    }
    (void)rtos_unlock_mutex(&manager->lock);

    if (result != BK_OK) {
        if (driver_started) {
            (void)bk_wifi_sta_stop();
        }
        BK_LOGE(TAG, "failed to start STA\r\n");
        return -1;
    }
    BK_LOGI(TAG, "STA driver started; waiting for IPv4\r\n");
    return 0;
}

int bk7259_wifi_manager_connect_candidate(const char *ssid, const char *password,
                                          uint32_t timeout_ms) {
    wifi_manager_t *manager = &s_wifi;
    if (!ssid || !password || !manager->operation_lock ||
        rtos_lock_mutex(&manager->operation_lock) != BK_OK) {
        return -1;
    }

    int result = -1;
    if (rtos_lock_mutex(&manager->lock) != BK_OK) {
        goto done;
    }
    bool ready = manager_ready_locked(manager);
    (void)rtos_unlock_mutex(&manager->lock);
    if (!ready || stop_sta(manager) < 0) {
        goto done;
    }

    (void)rtos_delay_milliseconds(WIFI_RESTART_DELAY_MS);
    drain_event(manager);
    uint32_t generation = 0;
    if (start_sta(manager, ssid, password, &generation) < 0) {
        goto done;
    }
    result = wait_for_ipv4(manager, ssid, generation, timeout_ms);
    if (result < 0) {
        (void)stop_sta(manager);
        BK_LOGW(TAG, "candidate STA connection failed\r\n");
    } else {
        BK_LOGI(TAG, "candidate STA connection succeeded\r\n");
    }

done:
    (void)rtos_unlock_mutex(&manager->operation_lock);
    return result;
}

int bk7259_wifi_manager_disconnect(void) {
    wifi_manager_t *manager = &s_wifi;
    if (!manager->operation_lock ||
        rtos_lock_mutex(&manager->operation_lock) != BK_OK) {
        return -1;
    }
    int result = stop_sta(manager);
    (void)rtos_unlock_mutex(&manager->operation_lock);
    return result;
}

static bool manager_has_ipv4_for(const char *ssid);

int bk7259_wifi_manager_save_credentials(const char *ssid, const char *password) {
    size_t ssid_length = bounded_string_length(ssid, WIFI_SSID_STR_LEN);
    size_t password_length = bounded_string_length(password, WIFI_PASSWORD_LEN);
    if (ssid_length == 0 || ssid_length >= WIFI_SSID_STR_LEN ||
        password_length >= WIFI_PASSWORD_LEN || !manager_has_ipv4_for(ssid)) {
        return -1;
    }

    wifi_credential_record_t record = {
        .magic = WIFI_CREDENTIAL_MAGIC,
        .version = WIFI_CREDENTIAL_VERSION,
        .record_size = sizeof(record),
        .ssid_length = (uint8_t)ssid_length,
        .password_length = (uint8_t)password_length,
    };
    memcpy(record.ssid, ssid, ssid_length + 1);
    memcpy(record.password, password, password_length + 1);
    EfErrCode result = ef_set_env_blob(WIFI_CREDENTIAL_KEY, &record, sizeof(record));
    secure_zero(&record, sizeof(record));
    if (result == EF_NO_ERR) {
        BK_LOGI(TAG, "Wi-Fi credentials saved\r\n");
    } else {
        BK_LOGW(TAG, "failed to save Wi-Fi credentials\r\n");
    }
    return result == EF_NO_ERR ? 0 : -1;
}

static int scan_result_compare(const wifi_scan_ap_info_t *left,
                               const wifi_scan_ap_info_t *right) {
    return right->rssi - left->rssi;
}

static void sort_scan_results(wifi_scan_ap_info_t *results, size_t count) {
    for (size_t i = 1; i < count; ++i) {
        wifi_scan_ap_info_t selected = results[i];
        size_t position = i;
        while (position > 0 &&
               scan_result_compare(&results[position - 1], &selected) > 0) {
            results[position] = results[position - 1];
            --position;
        }
        results[position] = selected;
    }
}

static int collect_scan_results(wifi_scan_ap_info_t *results, size_t capacity,
                                size_t *result_count) {
    wifi_scan_result_t scan = {0};
    *result_count = 0;
    if (bk_wifi_scan_get_result(&scan) != BK_OK || scan.ap_num < 0 ||
        (scan.ap_num > 0 && !scan.aps)) {
        return -1;
    }

    for (int i = 0; i < scan.ap_num; ++i) {
        wifi_scan_ap_info_t *candidate = &scan.aps[i];
        if (!string_is_terminated(candidate->ssid, sizeof(candidate->ssid)) ||
            candidate->ssid[0] == '\0') {
            continue;
        }

        size_t position = 0;
        while (position < *result_count &&
               strcmp(results[position].ssid, candidate->ssid) != 0) {
            ++position;
        }
        if (position < *result_count) {
            if (candidate->rssi > results[position].rssi) {
                results[position] = *candidate;
            }
        } else if (*result_count < capacity) {
            results[(*result_count)++] = *candidate;
        }
    }
    bk_wifi_scan_free_result(&scan);
    sort_scan_results(results, *result_count);
    return 0;
}

int bk7259_wifi_manager_scan_sync(wifi_scan_ap_info_t *results, size_t capacity,
                                  size_t *result_count, uint32_t timeout_ms) {
    wifi_manager_t *manager = &s_wifi;
    if (!results || capacity == 0 || !result_count || !manager->operation_lock ||
        rtos_lock_mutex(&manager->operation_lock) != BK_OK) {
        return -1;
    }
    *result_count = 0;

    int result = -1;
    if (rtos_lock_mutex(&manager->lock) != BK_OK) {
        goto done;
    }
    if (!manager_ready_locked(manager)) {
        (void)rtos_unlock_mutex(&manager->lock);
        goto done;
    }
    manager->scan_done = false;
    manager->scan_in_progress = true;
    (void)rtos_unlock_mutex(&manager->lock);
    drain_event(manager);

    if (bk_wifi_scan_start(NULL) != BK_OK) {
        goto finish_scan;
    }
    uint32_t start_ms = rtos_get_time();
    for (;;) {
        if (rtos_lock_mutex(&manager->lock) != BK_OK) {
            break;
        }
        bool ready = manager_ready_locked(manager);
        bool done = manager->scan_done;
        (void)rtos_unlock_mutex(&manager->lock);
        if (!ready) {
            break;
        }
        if (done) {
            result = collect_scan_results(results, capacity, result_count);
            break;
        }

        uint32_t remaining_ms = remaining_time_ms(start_ms, timeout_ms);
        if (remaining_ms == 0) {
            break;
        }
        (void)rtos_get_semaphore(&manager->event,
                                 remaining_ms < WIFI_WAIT_SLICE_MS
                                     ? remaining_ms
                                     : WIFI_WAIT_SLICE_MS);
    }

finish_scan:
    if (rtos_lock_mutex(&manager->lock) == BK_OK) {
        bool in_progress = manager->scan_in_progress;
        manager->scan_in_progress = false;
        manager->scan_done = false;
        (void)rtos_unlock_mutex(&manager->lock);
        if (in_progress) {
            (void)bk_wifi_scan_stop();
        }
    }
done:
    (void)rtos_unlock_mutex(&manager->operation_lock);
    return result;
}

static bool unregister_callback(event_module_t module, int event_id,
                                event_cb_t callback) {
    bk_err_t result = bk_event_unregister_cb(module, event_id, callback);
    return result == BK_OK || result == BK_ERR_EVENT_NO_CB;
}

