junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_wifi.c
int bk7259_wifi_prepare(void) {
    wifi_manager_t *manager = &s_wifi;
    if (manager->prepared) {
        return manager->shutting_down ? -1 : 0;
    }
    if (easyflash_init() != EF_NO_ERR || rtos_init_mutex(&manager->lock) != BK_OK ||
        rtos_init_mutex(&manager->operation_lock) != BK_OK ||
        rtos_init_semaphore(&manager->event, 1) != BK_OK) {
        goto fail;
    }

    if (bk_event_register_cb(EVENT_MOD_NETIF, EVENT_NETIF_GOT_IP4,
                             wifi_event_callback, manager) != BK_OK) {
        goto fail;
    }
    manager->netif_callback_registered = true;
    if (bk_event_register_cb(EVENT_MOD_WIFI, EVENT_WIFI_STA_DISCONNECTED,
                             wifi_event_callback, manager) != BK_OK) {
        goto fail;
    }
    manager->disconnect_callback_registered = true;
    if (bk_event_register_cb(EVENT_MOD_WIFI, EVENT_WIFI_SCAN_DONE,
                             wifi_event_callback, manager) != BK_OK) {
        goto fail;
    }
    manager->scan_callback_registered = true;

    if (rtos_lock_mutex(&manager->lock) != BK_OK) {
        goto fail;
    }
    manager->prepared = true;
    (void)rtos_unlock_mutex(&manager->lock);
    BK_LOGI(TAG, "Wi-Fi manager ready\r\n");
    return 0;

fail:
    if (manager->scan_callback_registered) {
        (void)unregister_callback(EVENT_MOD_WIFI, EVENT_WIFI_SCAN_DONE,
                                  wifi_event_callback);
    }
    if (manager->disconnect_callback_registered) {
        (void)unregister_callback(EVENT_MOD_WIFI, EVENT_WIFI_STA_DISCONNECTED,
                                  wifi_event_callback);
    }
    if (manager->netif_callback_registered) {
        (void)unregister_callback(EVENT_MOD_NETIF, EVENT_NETIF_GOT_IP4,
                                  wifi_event_callback);
    }
    if (manager->event) {
        (void)rtos_deinit_semaphore(&manager->event);
    }
    if (manager->operation_lock) {
        (void)rtos_deinit_mutex(&manager->operation_lock);
    }
    if (manager->lock) {
        (void)rtos_deinit_mutex(&manager->lock);
    }
    *manager = (wifi_manager_t){0};
    BK_LOGE(TAG, "Wi-Fi manager initialization failed\r\n");
    return -1;
}

void bk7259_wifi_shutdown(void) {
    wifi_manager_t *manager = &s_wifi;
    if (!manager->prepared || !manager->lock) {
        return;
    }

    if (rtos_lock_mutex(&manager->lock) != BK_OK) {
        return;
    }
    manager->shutting_down = true;
    manager->sdk_attached = false;
    manager->emit = NULL;
    manager->emit_user_data = NULL;
    manager->last_sdk_event_valid = false;
    (void)rtos_unlock_mutex(&manager->lock);
    signal_waiter(manager);

    if (rtos_lock_mutex(&manager->operation_lock) != BK_OK) {
        return;
    }
    if (rtos_lock_mutex(&manager->lock) == BK_OK) {
        bool scan_in_progress = manager->scan_in_progress;
        manager->scan_in_progress = false;
        manager->scan_done = false;
        (void)rtos_unlock_mutex(&manager->lock);
        if (scan_in_progress) {
            (void)bk_wifi_scan_stop();
        }
    }
    (void)stop_sta(manager);

    bool detached = true;
    if (manager->scan_callback_registered) {
        detached = unregister_callback(EVENT_MOD_WIFI, EVENT_WIFI_SCAN_DONE,
                                       wifi_event_callback) && detached;
    }
    if (manager->disconnect_callback_registered) {
        detached = unregister_callback(EVENT_MOD_WIFI, EVENT_WIFI_STA_DISCONNECTED,
                                       wifi_event_callback) && detached;
    }
    if (manager->netif_callback_registered) {
        detached = unregister_callback(EVENT_MOD_NETIF, EVENT_NETIF_GOT_IP4,
                                       wifi_event_callback) && detached;
    }
    if (!detached) {
        BK_LOGE(TAG, "failed to detach Wi-Fi event callbacks\r\n");
        (void)rtos_unlock_mutex(&manager->operation_lock);
        return;
    }

    (void)rtos_unlock_mutex(&manager->operation_lock);
    (void)rtos_deinit_semaphore(&manager->event);
    (void)rtos_deinit_mutex(&manager->operation_lock);
    (void)rtos_deinit_mutex(&manager->lock);
    *manager = (wifi_manager_t){0};
    BK_LOGI(TAG, "Wi-Fi manager stopped\r\n");
}

static bool manager_has_ipv4_for(const char *ssid) {
    wifi_manager_t *manager = &s_wifi;
    if (!ssid || !sta_link_matches(ssid) ||
        rtos_lock_mutex(&manager->lock) != BK_OK) {
        return false;
    }
    bool matches = manager_ready_locked(manager) && manager->sta_started &&
                   strcmp(manager->target_ssid, ssid) == 0;
    if (matches) {
        set_sta_connected_locked(manager);
    }
    (void)rtos_unlock_mutex(&manager->lock);
    return matches;
}

int mybot_bk7259_ensure_network(const char *device_id) {
    wifi_manager_t *manager = &s_wifi;
    if (!device_id || !device_id[0] || !manager->prepared) {
        return -1;
    }

    wifi_credential_record_t record;
    int loaded = load_credentials(&record);
    if (loaded == 0) {
        BK_LOGI(TAG, "connecting saved STA\r\n");
        if (manager_has_ipv4_for(record.ssid)) {
            secure_zero(&record, sizeof(record));
            (void)bk7259_lcd_show_screen(MYBOT_LCD_SCREEN_STARTING_SERVICES);
            BK_LOGI(TAG, "saved STA is already connected\r\n");
            return 0;
        }
        (void)bk7259_lcd_show_screen(MYBOT_LCD_SCREEN_WIFI_PROVISIONING);
        int result = bk7259_wifi_manager_connect_candidate(
            record.ssid, record.password, WIFI_CONNECT_TIMEOUT_MS);
        secure_zero(&record, sizeof(record));
        if (result == 0) {
            (void)bk7259_lcd_show_screen(MYBOT_LCD_SCREEN_STARTING_SERVICES);
            BK_LOGI(TAG, "saved STA connected\r\n");
            return 0;
        }
        BK_LOGW(TAG, "saved Wi-Fi connection failed, starting APSTA\r\n");
    } else if (loaded < 0) {
        BK_LOGW(TAG, "saved Wi-Fi credentials are invalid, starting APSTA\r\n");
    } else {
        BK_LOGI(TAG, "no saved Wi-Fi credentials, starting APSTA\r\n");
    }
    secure_zero(&record, sizeof(record));
    return run_provisioning_portal(device_id) == 0 ? 1 : -1;
}

int mybot_bk7259_provision_wifi(const char *device_id) {
    if (!device_id || !device_id[0]) {
        return -1;
    }
    BK_LOGI(TAG, "starting requested APSTA provisioning\r\n");
    int result = bk7259_wifi_manager_disconnect();
    if (result != 0) {
        BK_LOGE(TAG, "failed to prepare STA for APSTA provisioning\r\n");
        return -1;
    }
    result = run_provisioning_portal(device_id);
    if (result < 0) {
        BK_LOGW(TAG, "APSTA provisioning failed\r\n");
    } else {
        BK_LOGI(TAG, "APSTA provisioning succeeded\r\n");
    }
    return result;
}

static int wifi_init(void **out_ctx, const char *device_id,
                     mybot_wifi_event_handler_t emit, void *user_data) {
    wifi_manager_t *manager = &s_wifi;
    if (!out_ctx || !device_id || !device_id[0] || !emit || !manager->lock) {
        return -1;
    }
    *out_ctx = NULL;

    if (rtos_lock_mutex(&manager->lock) != BK_OK) {
        return -1;
    }
    if (!manager_ready_locked(manager) || manager->sdk_attached) {
        (void)rtos_unlock_mutex(&manager->lock);
        return -1;
    }

    manager->emit = emit;
    manager->emit_user_data = user_data;
    manager->last_sdk_event_valid = false;
    manager->sdk_attached = true;
    *out_ctx = manager;
    if (manager->sta_has_ip) {
        emit_sdk_transition_locked(manager, MYBOT_WIFI_EVENT_STA_CONNECTED);
    }
    (void)rtos_unlock_mutex(&manager->lock);
    BK_LOGI(TAG, "Wi-Fi callbacks attached to MyBot\r\n");
    return 0;
}

static void wifi_destroy(void *opaque) {
    wifi_manager_t *manager = opaque;
    if (manager != &s_wifi || !manager->lock ||
        rtos_lock_mutex(&manager->lock) != BK_OK) {
        return;
    }

    manager->sdk_attached = false;
    manager->emit = NULL;
    manager->emit_user_data = NULL;
    manager->last_sdk_event_valid = false;
    (void)rtos_unlock_mutex(&manager->lock);
    BK_LOGI(TAG, "Wi-Fi callbacks detached from MyBot\r\n");
}

const mybot_wifi_ops_t g_mybot_bk7259_wifi_ops = {
    .init = wifi_init,
    .destroy = wifi_destroy,
};
